[GUNLANCER X2SoldierClassTemplate]
+DisplayName="枪戟战士"
+ClassSummary="枪戟战士擅长使用长戟进行近距离战斗，同时凭借可发射特制弹药的内置枪械，在远程作战中同样具备致命威力。他们是适应各类战场的全能型战士。"
+LeftAbilityTreeTitle="枪戟技法"
+RightAbilityTreeTitle="反击专精"
AbilityTreeTitles[0]="枪戟技法"
AbilityTreeTitles[1]="反击专精"
AbilityTreeTitles[2]="枪械长戟"
AbilityTreeTitles[3]="威能强化"
AbilityTreeTitles[4]="XCOM"

+RandomNickNames[0]="屠戮者"
+RandomNickNames[1]="伐木者"
+RandomNickNames[2]="角斗士"
+RandomNickNames[3]="粉碎者"
+RandomNickNames[4]="西班牙斗士"
+RandomNickNames[5]="破坏者"
+RandomNickNames[6]="诸神黄昏"
+RandomNickNames[7]="浩劫"
+RandomNickNames[8]="炽烈者"
+RandomNickNames[9]="堡垒"
+RandomNickNames[10]="毁灭者"
+RandomNickNames[11]="普罗克西莫"
+RandomNickNames[12]="克雷默大剑"
+RandomNickNames[13]="渡鸦"
+RandomNickNames[14]="拦截者"
+RandomNickNames[15]="雷电"
+RandomNickNames[16]="地狱使者"
+RandomNickNames[17]="剑歌者"
+RandomNickNames[18]="不屈者"
+RandomNickNames[19]="冲击爆破者"
+RandomNickNames[20]="魏斯海姆"
+RandomNickNames[21]="锐刃"
+RandomNickNames[22]="闪电突袭者"
+RandomNickNames[23]="噼啪者"
+RandomNickNames[24]="赤红"
+RandomNickNames[25]="雷德伦"
+RandomNickNames[26]="电击客"

RandomNickNames_Male[0]="托尔"
RandomNickNames_Male[1]="雷霆领主"
RandomNickNames_Male[2]="斧战士"
RandomNickNames_Male[3]="马格纳斯"


RandomNickNames_Female[0]="女武神"
RandomNickNames_Female[1]="斯嘉丽"
RandomNickNames_Female[2]="剑刃女王"
RandomNickNames_Female[3]="盾之侍女"